---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentLoadPhaseB
source: html/71151c73-36e8-70c8-c753-9502c5143e23.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentLoadPhaseB Property

The ApparentLoadPhaseB value of the Electrical System.

## Syntax (C#)
```csharp
public double ApparentLoadPhaseB { get; }
```

## Remarks
This property is used to retrieve the ApparentLoadPhaseB value of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!